PARTNO        DS        CL09
DESC          DS        CL30
              DS        CL05
UNITP         DS        PL04
QUANTH        DS        PL03
              DS        CL01
QUANTO        DS        HL02
REORDER       DS        HL02
              DS        CL01
OLDNO         DS        CL09
              DS        CL01
ITEMCAT       DS        CL10
              DS        CL23
