      *                                                             
      *  record layout for input file                               
      *                                                             
           10  I-PARTNO             PIC X(09).                      
           10  I-DESCR              PIC X(30).                      
           10                       PIC X(05).                      
           10  I-UNITPR             PIC S9(04)V999  COMP-3.         
           10  I-QOH                PIC S9(05)      COMP-3.         
           10                       PIC X.                          
           10  I-QOO                PIC S9(02)      COMP-4.         
           10  I-RDRLVL             PIC S9(02)      COMP-4.         
           10                       PIC X.                          
           10  I-OLDPTNO            PIC X(09).                      
           10                       PIC X.                          
           10  I-ITEMCAT            PIC X(10).                      
           10                       PIC X(03).                      
